In [1]:
import pandas as pd

In [2]:
toyota_data = pd.read_csv("data/car_sales/toyota_sales_data.csv")

In [3]:
toyota_data.head()

,sale_id,sale_rep_id,sale_date,car_model,sale_amount,commission_pct,sale_status
0,1,16,2024-11-18,Tundra,44496.88,0.05,Completed
1,2,11,2024-11-08,Tacoma,34824.72,NaN,Pending
2,3,5,2024-11-03,Corolla,20275.08,NaN,Completed
3,4,20,2024-11-06,Corolla,20068.93,NaN,Completed
4,5,1,2024-11-26,Tundra,49811.99,0.03,Completed

In [4]:
sales_reps_data = pd.read_csv("data/car_sales/sales_reps_data.csv")

In [5]:
sales_reps_data.head()

,rep_id,first_name,last_name,email,phone_number,hire_date,region,status
0,1,Anthony,Davis,anthony.davis@toyota.com,-5390,7/21/22,North,Active
1,2,Edward,Smith,edward.smith@toyota.com,-10708,12/24/19,North,Active
2,3,Paul,Jones,paul.jones@toyota.com,-2301,9/6/22,East,Active
3,4,Robert,Lopez,robert.lopez@toyota.com,-8631,11/21/20,South,Active
4,5,Steven,Wilson,steven.wilson@toyota.com,-6958,3/17/22,West,Active

In [6]:
toyota_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   sale_id         5000 non-null   int64
 1   sale_rep_id     5000 non-null   int64
 2   sale_date       5000 non-null   object
 3   car_model       5000 non-null   object
 4   sale_amount     5000 non-null   float64
 5   commission_pct  3726 non-null   float64
 6   sale_status     5000 non-null   object
dtypes: float64(2), int64(2), object(3)
memory usage: 273.6+ KB

In [7]:
toyota_data.shape

(5000, 7)

In [9]:
toyota_data.columns.tolist()

['sale_id',
 'sale_rep_id',
 'sale_date',
 'car_model',
 'sale_amount',
 'commission_pct',
 'sale_status']

In [10]:
toyota_data.dtypes

sale_id             int64
sale_rep_id         int64
sale_date          object
car_model          object
sale_amount       float64
commission_pct    float64
sale_status        object
dtype: object